export const InformationMain = {
	news: [
		{
			ukr: "Рекомендації для громадян щодо коронавірусу (2019-nCoV)",
			url: '#'
		},
		{
			ukr: "Максим Степанов: Ми не допустимо, щоб в медиків знижувалася зарплата через реформу",
			url: '#'
		},
		{
			ukr: "Оперативна інформація про поширення коронавірусної інфекції 2019-nCoV",
			url: '#'
		},
		{
			ukr: "Заступник Міністра Ірина Микичак: Нове керівництво МОЗ відновлює щоденну комунікацію з областями та медичними закладами на місцях",
			url: '#'
		}	
	],
	magazines: [
		{
			text: "Сучасна гастроентерологія",
			url: "#"
		},
		{
			text: "Український журнал дерматології, венерології, косметології",
			url: "#"
		},
		{
			text: "Клінічна ендокринологія та ендокринна хірургія",
			url: "#"
		},
		{
			text: "Український журнал дитячої ендокринології",
			url: "#"
		},
		{
			text: "Туберкульоз, легеневі хвороби, ВІЛ-інфекція",
			url: "#"
		},
		{
			text: "Український неврологічний журнал",
			url: "#"
		},
		{
			text: "Український терапевтичний журнал",
			url: "#"
		},
		{
			text: "Серце і судини",
			url: "#"
		},
		{
			text: "Хірургія України",
			url: "#"
		}
	
	],
	current: {
		imgLinkUrl: "#",
		imgSrc: './img/Слой_24.png',
		imgLinkText: "АКТУАЛЬНА ПУБЛІКАЦІЯ",
		previewTitle: "В Україні триває тиждень імунізації",
		previewText: "З 21 по 26 квітня триває Європейський тиждень імунізації. За ініціативи ВООЗ, в Україні цей тиждень проходить щорічно із 2006 року. Мета — підвищити рівень вакцинування через інформування людей щодо процесів пов’язаних із імунізацією."
	}
}

export const articleDataArr = [
	{
		articleTitle: "Перша науково-практична медична стаття в рубриці",
		articleTextFirst: "Друга науково-практична медична стаття в рубриці, її назва трошки довша і займає три рядки",
		articleTextSecond: "Третя науково-практична медична стаття в цій рубриці, що присвячена медицині",
		titleUrl: '#',
		titleText: "КАРДІОЛОГІЯ",
		imgSrc: './img/Слой_27.png'
		
	},
	{
		articleTitle: "Перша науково-практична медична стаття в рубриці",
		articleTextFirst: "Друга науково-практична медична стаття в рубриці, її назва трошки довша і займає три рядки",
		articleTextSecond: "Третя науково-практична медична стаття в цій рубриці, що присвячена медицині",
		titleUrl: '#',
		imgSrc: './img/Слой_27.png',
		titleText: "ХІРУРГІЯ"
	},
	{
		articleTitle: "Перша науково-практична медична стаття в рубриці",
		articleTextFirst: "Друга науково-практична медична стаття в рубриці, її назва трошки довша і займає три рядки",
		articleTextSecond: "Третя науково-практична медична стаття в цій рубриці, що присвячена медицині",
		titleUrl: '#',
		imgSrc: './img/Слой_27.png',
		titleText: "ГАСТРОЕНТЕРОЛОГІЯ"
	},
	{
		articleTitle: "Перша науково-практична медична стаття в рубриці",
		articleTextFirst: "Друга науково-практична медична стаття в рубриці, її назва трошки довша і займає три рядки",
		articleTextSecond: "Третя науково-практична медична стаття в цій рубриці, що присвячена медицині",
		titleUrl: '#',
		imgSrc: './img/Слой_27.png',
		titleText: "ЕНДОКРИНОЛОГІЯ"
	},
	{
		articleTitle: "Перша науково-практична медична стаття в рубриці",
		articleTextFirst: "Друга науково-практична медична стаття в рубриці, її назва трошки довша і займає три рядки",
		articleTextSecond: "Третя науково-практична медична стаття в цій рубриці, що присвячена медицині",
		titleUrl: '#',
		imgSrc: './img/Слой_27.png',
		titleText: "ДЕРМАТОВЕНЕРОЛОГІЯ"
	},
	{
		articleTitle: "Перша науково-практична медична стаття в рубриці",
		articleTextFirst: "Друга науково-практична медична стаття в рубриці, її назва трошки довша і займає три рядки",
		articleTextSecond: "Третя науково-практична медична стаття в цій рубриці, що присвячена медицині",
		titleUrl: '#',
		imgSrc: './img/Слой_27.png',
		titleText: "НЕВРОЛОГІЯ"
	},
	{
		articleTitle: "Перша науково-практична медична стаття в рубриці",
		articleTextFirst: "Друга науково-практична медична стаття в рубриці, її назва трошки довша і займає три рядки",
		articleTextSecond: "Третя науково-практична медична стаття в цій рубриці, що присвячена медицині",
		titleUrl: '#',
		imgSrc: './img/Слой_27.png',
		titleText: "ТЕРАПІЯ"
	},
	{
		articleTitle: "Перша науково-практична медична стаття в рубриці",
		articleTextFirst: "Друга науково-практична медична стаття в рубриці, її назва трошки довша і займає три рядки",
		articleTextSecond: "Третя науково-практична медична стаття в цій рубриці, що присвячена медицині",
		titleUrl: '#',
		imgSrc: './img/Слой_27.png',
		titleText: "ЛЕГЕНЕВІ ХВОРОБИ"
	},
	{
		articleTitle: "Перша науково-практична медична стаття в рубриці",
		articleTextFirst: "Друга науково-практична медична стаття в рубриці, її назва трошки довша і займає три рядки",
		articleTextSecond: "Третя науково-практична медична стаття в цій рубриці, що присвячена медицині",
		titleUrl: '#',
		imgSrc: './img/Слой_27.png',
		titleText: "ДИТЯЧА ЕНДОКРИНОЛОГІЯ"
	},
	{
		articleTitle: "Перша науково-практична медична стаття в рубриці",
		articleTextFirst: "Друга науково-практична медична стаття в рубриці, її назва трошки довша і займає три рядки",
		articleTextSecond: "Третя науково-практична медична стаття в цій рубриці, що присвячена медицині",
		titleUrl: '#',
		imgSrc: './img/Слой_27.png',
		titleText: "ІНФЕКЦІЙНІ ХВОРОБИ"
	},
	{
		articleTitle: "Перша науково-практична медична стаття в рубриці",
		articleTextFirst: "Друга науково-практична медична стаття в рубриці, її назва трошки довша і займає три рядки",
		articleTextSecond: "Третя науково-практична медична стаття в цій рубриці, що присвячена медицині",
		titleUrl: '#',
		imgSrc: './img/Слой_27.png',
		titleText: "ЕНДОКРИННА ХІРУРГІЯ"
	},
	{
		articleTitle: "Перша науково-практична медична стаття в рубриці",
		articleTextFirst: "Друга науково-практична медична стаття в рубриці, її назва трошки довша і займає три рядки",
		articleTextSecond: "Третя науково-практична медична стаття в цій рубриці, що присвячена медицині",
		titleUrl: '#',
		imgSrc: './img/Слой_27.png',
		titleText: "ТУБЕРКУЛЬОЗ"
	}
]

export const recomendationData = [
	{	
		recomendationParagraphFirst: "Перша назва клінічної настанови, яка займає два рядки",
		recomendationParagraphSecond: "Друга назва клінічної настанови, яка займає два рядки",
		recomendationParagraphThird: "Третя назва клінічної настанови, яка займає два рядки",
		titleText: "ТЕРАПІЯ",
		titleClassName: "recomendationItemTitle"
	},
	{	
		recomendationParagraphFirst: "Перша назва клінічної настанови, яка займає два рядки",
		recomendationParagraphSecond: "Друга назва клінічної настанови, яка займає два рядки",
		recomendationParagraphThird: "Третя назва клінічної настанови, яка займає два рядки",
		titleText: "КАРДІОЛОГІЯ",
		titleClassName: "recomendationItemTitle"
	},
	{	
		recomendationParagraphFirst: "Перша назва клінічної настанови, яка займає два рядки",
		recomendationParagraphSecond: "Друга назва клінічної настанови, яка займає два рядки",
		recomendationParagraphThird: "Третя назва клінічної настанови, яка займає два рядки",
		titleText: "ЕНДОКРИНОЛОГІЯ",
		titleClassName: "recomendationItemTitle"
	}
]

export const ActivitiesData = [
	{
		link: "#",
		imgSrc: './img/Слой_27.png',
		imgAlt: '#'
	},
	{	
		link: "#",
		imgSrc: './img/Слой_27.png',
		imgAlt: '#'
	},
	{	
		link: "#",
		imgSrc: './img/Слой_27.png',
		imgAlt: '#'
	},
	{	
		link: "#",
		imgSrc: './img/Слой_27.png',
		imgAlt: '#'
	}
]

export const FooterFirstData = [
	{
		text: 'Про компанію',
		url: '#'
	},
	{
		text: 'Проекти',
		url: '#'
	},
	{
		text: 'Послуги',
		url: '#'
	}
]

export const FooterSecondData = [
	{	_id: 1,
		titleText: "Адреса",
		listDataArr: [
			{
				text: "вул. Академіка Єфремова, 19а, оф. 3, "
			},
			{
				text: "м. Київ, 03179"
			},
			{
				text: "Тел.: +38 044 298 00 60"
			},
			{
				text: "Електронна пошта: vitapol3@gmail.com, vitapol2@ukr.net"
			}
		]
	},
	{	_id: 2,
		titleText: "Завідувач секретаріату науково-практичних журналів",
		listDataArr: [
			{
				text: "Ольга Миколаївна Берник"
			},
			{
				text: "Тел.: +38 044 298 00 61"
			},
			{
				text: "Електронна пошта: vitapol3@gmail.com"
			}
		]
	}
]

export const homePicture = {
	src: './img/Слой_19.png',
	alt: 'home'
}

export const Links = [
	{
		href: '#',
		text: 'Кардіологія'
	},
	{
		href: '#',
		text: 'Хірургія'
	},
	{
		href: '#',
		text: 'Гастроентерологія'
	},
	{
		href: '#',
		text: 'Ендокринологія'
	},
	{
		href: '#',
		text: 'Дерматологія'
	},
	{
		href: '#',
		text: 'Неврологія'
	},
	{
		href: '#',
		text: 'Терапія'
	}
];